<a href="https://colab.research.google.com/github/Rohit-Thakre/Machine-Learning-/blob/main/Code/Pandas/2DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
#creating empty data frame
emt = pd.DataFrame()
emt

Empty DataFrame
Columns: []
Index: []

In [3]:
#creating data frame from list 
lst = [1,2,3,4]

In [4]:
#creating dataframe from the list 
lst_d = pd.DataFrame(lst)
lst_d

   0
0  1
1  2
2  3
3  4

In [5]:
#creating data frame from list of list 
lst1 = [[1,2,3],[4,5,6],[7,8,9]]
lst_lst = pd.DataFrame(lst1)
lst_lst

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

#DataFrame from dict

In [6]:
#creating data frame from dictionary 
dic = {"name":["rohit", "ravi"], "id":[102,453]}

In [7]:
dic_d =pd.DataFrame(dic)
dic_d

    name   id
0  rohit  102
1   ravi  453

#Renaming columns

In [13]:
dic_d.rename(columns={'name':'test_name'})

  test_name   id
0     rohit  102
1      ravi  453

In [8]:
#creating data frame from list of dict
lst_dic = [{"a":1, "b":2}, {"c":45,"d":78}]

In [9]:
lst_dic_d = pd.DataFrame(lst_dic)
lst_dic_d

     a    b     c     d
0  1.0  2.0   NaN   NaN
1  NaN  NaN  45.0  78.0

In [10]:
#creating data frame from dic of series
dic_s = {"id":pd.Series([1,2,3]),"sn":pd.Series([45,56,79])}

In [11]:
dic_s_d = pd.DataFrame(dic_s)
dic_s_d

   id  sn
0   1  45
1   2  56
2   3  79